<img src="Tarjeta.png">

# Recap Last Class!

En la última clase habíamos introducido Pandas!
    **Pandas es una librería open source Python para realizar análisis de datos**. 
Aunque Python es ya de por si un buen lenguaje para la preparación de datos, nunca ha sido excelente para realizar análisis (tendencia de usar R, SQL o incluso Excel para realizar este tipo de tareas), hasta la llegada de Pandas!

In [1]:
import pandas as pd

Además, vimos que Pandas introduce dos nuevas estructura de datos a Python:
- Series
- DataFrames
ambas construidas sobre NumPy; lo que las hace dos estructura de datos rápidas.

![title](https://storage.googleapis.com/lds-media/images/series-and-dataframe.width-1200.png)

Hoy introduciremos los DataFrames, el objeto por predilección del Data Science en Python!!

# Dataframes de Pandas

## Introducción

Un DataFrame de Python es una tabla 2-dimensional, potencialmente hetereogéna y con ejes etiquetados (filas y columnas).

Propiedades de los DataFrames:
  - Columnas pueden ser de distintos tipos de datos
  - modificable de tamaño
  - ejes etiquetados (filas y columnas)
  - se pueden realizar operaciones aritméticas en filas y columnas

Los DataFrames de Pandas consisten básicamente de 3 elementos principales:
-  datos (*data*)
-  filas (*rows*)
-  columnas (*columns*)

![title](https://media.geeksforgeeks.org/wp-content/uploads/finallpandas.png)

Un DataFrame de pandas se genera mediante el siguien constructor:

In [ ]:
mi_serie = pd.Series(data= mi_array, index = ['a','b','c', dtype,])

df = pd.DataFrame( data, index, columns, dtype, copy)

**Importante!** La notación nos recomienda siempre que creemos DataFrames darles nombres con sentido, derivados del acrónimo **d**ata**f**rame: df, df1, df2 etc

|Parámetro|Descripción|
|--------|------------|
|**data**| Los datos que incorpora como unpit pueden tener varias formas como: *ndarray*, *series*, *list*, *dict*, o otros dataframes
|**index**| Al ser una estructura 2-d tanto las filas como las columnas llevan etiquetas, siendo **las etiquetas de las filas** predeterminadas a *np.arange(n)* si no se especifican de otra forma|
|**columns**| Las etiquetas de las columnas están prestablecidas a *np.arange(n)* si no se especifican de otra forma|
|**dtype**| Tipo de datos de **cada** columan|
|**copy**| Este comando se utiliza para copiar los datos inputados. Por default está a False

### Tipos de datos - dtype( )

Los DataFrames de pandas sostienen los siguientes tipos de datos:

![title](https://pbpython.com/images/pandas_dtypes.png)

## Creación de un DataFrame

Como hemos comentado, un DataFrame de pandas se puede originar con distintos tipos e inputs:
- listas (*list*)
- diccionarios (*dict*)
- Pandas Series
- Numpy ndarrays
- otros Pandas DataFrames

### Crear DataFrame vacío

El DataFrame más básico que podamos pensar es un DataFrame vacío de contenido

In [36]:
import pandas as pd

In [6]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

Vemos que no tenemos ni columnas ni índices de filas, simplemente tenemos un dataFrame vacío

### DataFrame de una Lista

Para crear un DataFrame a partir de una lista simplemente tenemos que pasarle al argumento **data** una lista o colección de listas.

##### EJEMPLO - DataFrame 1d - a partir de una lista

In [37]:
lista_datos = ['uno','dos','tres','cuatro','cinco']
df = pd.DataFrame(data=lista_datos)
df

        0
0     uno
1     dos
2    tres
3  cuatro
4   cinco

En este ejemplo nuestros **datos son una lista**, por lo que **el dataframe sólo contiene una única columna**.

Además, no hemos especificado ni el nombre de la columna resultante ni los índices de las filas (etiqueta de cada elemento de la lista); por lo que el índice de columna y de filas coge el valor prestablecido, empezando por 0 hasta n; donde n es el nº de elementos que hay en el DataFrame

##### EJEMPLO - DataFrame 2d - a partir de lista de listas

In [2]:
lista_de_listas = [["Ana",25], ["Yolanda", 35] , ["Eduardo", 14]]

In [3]:
df_2 = pd.DataFrame(data = lista_de_listas)

In [4]:
df_2

         0   1
0      Ana  25
1  Yolanda  35
2  Eduardo  14

In [5]:
lista_de_listas = [['Alex',10],['Berta',12],['Carmen',13]]
df = pd.DataFrame(data = lista_de_listas)
df

        0   1
0    Alex  10
1   Berta  12
2  Carmen  13

Al pasar una lista de listas, el DataFrame aloca los elementos en 2 columnas con tantos elementos como parejas de listas tenía el objeto inicial.

Fijémonos que todavía no hemos asignado ningún nombre a las columnas ni a las filas del DataFrame!

##### EJEMPLO - DataFrame 2d - asignar nombre a columnas

Vemos que la primera columna son nombres mientras que la segunda es la edad de cada persona.

Para asignar nombre a las columnas simplemente tenemos que pasar una **lista de nombres** con **tantos nombres de columnas como columnas haya** al parámetro *columns()* del DataFrame

In [6]:
lista_de_listas = [['Alex',10],['Berta',12],['Carmen',13]]



#defino una lista que contiene la
#descripción de cada campo de cada lista dentro de mi lista global

nombre_columnas = ['Nombre','Edad']

In [7]:
df = pd.DataFrame( data = lista_de_listas, columns = nombre_columnas )
df

   Nombre  Edad
0    Alex    10
1   Berta    12
2  Carmen    13

#### Fijar tipo de datos dtype de un DataFrame

Ya hemos visto como asignar datos al parámetro *data*, nombres de columnas al parámetro *columns* al crear u DataFrame. 

Finalmente, veremos cómo fijar un tipo de datos determinado en nuestro DataFrame mediante el parámetro *dtype*

In [8]:
df

   Nombre  Edad
0    Alex    10
1   Berta    12
2  Carmen    13

In [10]:
nombre_filas = ['Est. 1', 'Est. 2', 'Est. 3']

In [11]:
df = pd.DataFrame( data = lista_de_listas, columns = nombre_columnas, index = nombre_filas, dtype = float  )
df

        Nombre  Edad
Est. 1    Alex  10.0
Est. 2   Berta  12.0
Est. 3  Carmen  13.0

In [14]:
lista_de_listas = [['Alex',10],['Berta',12],['Carmen',13]]
nombre_columnas = ['Nombre','Edad']

df = pd.DataFrame(data = lista_de_listas, columns = nombre_columnas, dtype =float)
df

   Nombre  Edad
0    Alex  10.0
1   Berta  12.0
2  Carmen  13.0

In [16]:
pd.DataFrame?

In [50]:
df2 = pd.DataFrame( data = lista_de_listas, index = nombre_filas, columns = nombre_columnas)
df2

              Nombre  Edad
Estudiante 1    Alex    10
Estudiante 2   Berta    12
Estudiante 3  Carmen    13

### DataFrame de un Diccionario de listas

Al crear un DataFrame hay que tener en mente las siguientes consideraciones:
   - todos los ndarrays tienen que tener la misma longitud
   - si se especifica un etiquetado, la longitud del índice tiene que ser equivalente a la longitud de los arrays
   - si no se especifica un índice, por default el indexado será **range(n)** , donde **n** = longitud array

##### EJEMPLO - sin etiquetas en indice

In [18]:
lista_de_listas = [  ['Tomás', 'Elena', 'Juana', 'Enrique'] , [28,34,29,42]       ]

In [20]:
#cuantas filas tendrá mi df?
df = pd.DataFrame(data = lista_de_listas)
df
#cuantas columnas tendrá?

       0      1      2        3
0  Tomás  Elena  Juana  Enrique
1     28     34     29       42

In [21]:
diccionario_de_listas = {  "nombres": ['Tomás', 'Elena', 'Juana'] , "edades": [28,34,0]      }

In [22]:
nombres_filas = ["Estudiante 1", "Estudiante 2", "Estudiante 3", "Estudiante 4"]

In [30]:
df2 = pd.DataFrame ( data = diccionario_de_listas, index= nombre_filas)
df2

             nombres  edades
Estudiante 1   Tomás      28
Estudiante 2   Elena      34
Estudiante 3   Juana       0

In [31]:
diccionario_gente = { 'Nombre':['Tomás', 'Elena', 'Juana', 'Enrique'],'Edad':[28,34,29,42] }
diccionario_gente

{'Nombre': ['Tomás', 'Elena', 'Juana', 'Enrique'], 'Edad': [28, 34, 29, 42]}

In [32]:
type(diccionario_gente)

dict

In [33]:
df2

             nombres  edades
Estudiante 1   Tomás      28
Estudiante 2   Elena      34
Estudiante 3   Juana       0

In [34]:
len(df2)

3

In [35]:
type(df2)

pandas.core.frame.DataFrame

In [36]:
print("Tenemos un diccionario (",type(diccionario_gente),") de ", len(diccionario_gente)," listas (", type(diccionario_gente['Nombre']),")")

Tenemos un diccionario ( <class 'dict'> ) de  2  listas ( <class 'list'> )

In [37]:
df = pd.DataFrame(diccionario_gente)
df

    Nombre  Edad
0    Tomás    28
1    Elena    34
2    Juana    29
3  Enrique    42

En este ejemplo el nombre de cada elemento del diccionario se transforma en el nombre de cada columna. Sin embargo, no hemos asignado un etiquetado a las filas

##### EJEMPLO - Creación df con un diccionario + etiquetas

In [38]:
mis_filas = ['fila1','fila2','fila3','fila4']

Vamos a comprobar que la longitud de los índices será coincidente con la longitud del DataFrame!

In [39]:
print("Tengo tantas etiquetas como filas?\n")
if len(mis_filas) == len(diccionario_gente['Nombre']):
    print("Sí! Entonces puedo asignar las etiquetas al DataFrame!")

Tengo tantas etiquetas como filas?

Sí! Entonces puedo asignar las etiquetas al DataFrame!

In [40]:
df = pd.DataFrame(diccionario_gente, index = mis_filas)
df

        Nombre  Edad
fila1    Tomás    28
fila2    Elena    34
fila3    Juana    29
fila4  Enrique    42

### DataFrame de una Lista de Diccionarios

Una lista de diccionarios nos sirve también para rellenar un DataFrame. 

**Las llaves del diccionario se cogen por default como nombres de las columnas**

##### EJEMPLO  - sin etiqueta en índice

In [41]:
lista_dicts = [  {'a': 1, 'b': 2}  ,    {'a': 5, 'b': 10, 'c': 20} ]
lista_dicts

[{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]

In [42]:
df3 = pd.DataFrame( data = lista_dicts)
df3

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [43]:
print("Tenemos una lista (",type(lista_dicts),") de ",len(lista_dicts), "diccionarios (",type(lista_dicts[0]),")")

Tenemos una lista ( <class 'list'> ) de  2 diccionarios ( <class 'dict'> )

In [65]:
df = pd.DataFrame(lista_dicts)
df

   a   b     c
0  1   2   NaN
1  5  10  20.0

Varias observaciones:
- Una lista de *2* elementos nos da lugar a un DataFrame de *2* filas 
- Así como las Series, los DataFrames son autocompletos en el sentido que en el caso que las dimensiones de los elementos que colisionan en un Dataframe no sean compatibles, **en lugar de saltar un error, se generan tantas filas o columnas según union() y se llenan de nulos según corresponda**

1. Vamos a crear un df a partir de una lista de diccionarios.
Esta lista va a contener dos diccionarios:
    - uno con elementos 2,3,4,1 con etiquetas: "a","b","c","d"
    - otro diccionario con elementos -1,2,3,1 con etiquetas: "a","d","e","b"

In [44]:
data = [{'a': 2, 'b': 3, 'c': 4, 'd': 1},{'a': 1, 'd': 2, 'e': 3, 'b': 1}]
df = pd.DataFrame(data)
df

   a  b    c  d    e
0  2  3  4.0  1  NaN
1  1  1  NaN  2  3.0

Etiqueta las filas del dataframe anterior!

In [45]:
df = pd.DataFrame(data, index=['first', 'second'])
df

        a  b    c  d    e
first   2  3  4.0  1  NaN
second  1  1  NaN  2  3.0

Puedes fijar columnas a mostras de la siguiente manera:

In [48]:
df2 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b', 'z'])
df2

        a  b   z
first   2  3 NaN
second  1  1 NaN

### Indexar un DataFrame: .index

In [49]:
diccionario_gente = {'Nombre':['Tomás', 'Elena', 'Juana', 'Enrique'],'Edad':[28,34,29,42],'Ciudad':['Barcelona',"Tarragona","Lleida","Huesca"], "Hermanos":[1,2,3,0]}


df = pd.DataFrame(diccionario_gente, index = ["Estudiante 1","Estudiante 2","Estudiante 3","Estudiante 4" ])
df

               Nombre  Edad     Ciudad  Hermanos
Estudiante 1    Tomás    28  Barcelona         1
Estudiante 2    Elena    34  Tarragona         2
Estudiante 3    Juana    29     Lleida         3
Estudiante 4  Enrique    42     Huesca         0

In [50]:
df.index

Index(['Estudiante 1', 'Estudiante 2', 'Estudiante 3', 'Estudiante 4'], dtype='object')

In [51]:
df.columns

Index(['Nombre', 'Edad', 'Ciudad', 'Hermanos'], dtype='object')

In [52]:
df.index = ["Profe1","Profe2","Profe3","Profe4"]

In [53]:
df

         Nombre  Edad     Ciudad  Hermanos
Profe1    Tomás    28  Barcelona         1
Profe2    Elena    34  Tarragona         2
Profe3    Juana    29     Lleida         3
Profe4  Enrique    42     Huesca         0

In [54]:
df.columns = ["N","E","C","H"]

In [61]:
df.rename?

In [55]:
df

              N   E          C  H
Profe1    Tomás  28  Barcelona  1
Profe2    Elena  34  Tarragona  2
Profe3    Juana  29     Lleida  3
Profe4  Enrique  42     Huesca  0

Si queremos cambiar las etiquetas de las filas rápidamente y de columnas existentes en un Datafram, usaremos **.index**

In [81]:
df.index = ['Profesor 1', 'Profesor 2','Profesor 3', 'Profesor 4']

In [82]:
df

             Nombre  Edad     Ciudad  Hermanos
Profesor 1    Tomás    28  Barcelona         1
Profesor 2    Elena    34  Tarragona         2
Profesor 3    Juana    29     Lleida         3
Profesor 4  Enrique    42     Huesca         0

Como ya vimos con las Series, los DataFrame se pueden ordenar por índices o valores. 
Pero como los DataFrames son multi-dimensionales, **a diferencia de las Series, hay que especificar qué columna de todo el DataFrame se desea ordenar**

In [63]:
d = {'Serie 1' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'Serie 2' : pd.Series([4.0, 5.0, 6.0, 7.0], index=['d', 'e', 'f', 'g'])}
d

{'Serie 1': a    1
 b    2
 c    3
 dtype: int64,
 'Serie 2': d    4.0
 e    5.0
 f    6.0
 g    7.0
 dtype: float64}

In [64]:
type(d)

dict

In [65]:
len(d)

2

In [66]:
df = pd.DataFrame(d)
df

   Serie 1  Serie 2
a      1.0      NaN
b      2.0      NaN
c      3.0      NaN
d      NaN      4.0
e      NaN      5.0
f      NaN      6.0
g      NaN      7.0

## Exploración de DataFrames

### Atributos de un DataFrame

Igual que las Series de Pandas, el objeto DataFrame tiene un conjunto de atributos (**df.atribute**) que nos permiten entender rápidamente el objeto:

|df.attribute|Descripción|
|----|----|
|**dtypes**| lista todos los tipos de datos de las columnas del dataframe |
|**columns**| lista el nombre de las columnas |
|**axes**| lista las etiquetas de las filas y nombres de las columnas |
|**ndim**| nº de dimensiones del dataframe|
|**size**| nº de elementos del dataframe|
|**shape**| devuelve  una tupla que representa la dimensionalidad del df, (*filas*x*columnas*)|
|**values**| representación NumPy de los datos|

Vamos a explorar un dataframe mediante los atributos del objeto.

In [67]:
d = {'uno' : pd.Series([10, 12, 3], index=['fila1', 'fila2', 'fila3']), 
   'two' : pd.Series([15.0, 2.0, 4.0], index=['fila1', 'fila2', 'fila3'])}

In [68]:
df = pd.DataFrame(d)
df

       uno   two
fila1   10  15.0
fila2   12   2.0
fila3    3   4.0

In [69]:
df.dtypes

uno      int64
two    float64
dtype: object

In [70]:
df.index

Index(['fila1', 'fila2', 'fila3'], dtype='object')

In [71]:
df.columns

Index(['uno', 'two'], dtype='object')

In [72]:
df.axes

[Index(['fila1', 'fila2', 'fila3'], dtype='object'),
 Index(['uno', 'two'], dtype='object')]

In [73]:
df.ndim

2

In [74]:
df.size

6

In [75]:
df.shape

(3, 2)

In [76]:
df.values

array([[10., 15.],
       [12.,  2.],
       [ 3.,  4.]])

### Métodos de un DataFrame

**Importante!** A diferencia de los atributos, **los métodos de un objeto de Python llevan paréntesis**

**Importante!** Recordemos que para conocer todos los métodos y atributos de un objeto de Python, usar la función

dir(objeto)

|df.**method()**|Descripción|
|----|----|
|**info()**| información básica del df
|**head(n)**| lista las primeras *n* filas |
|**tail(n)**| lista las últimas *n* filas |
|**describe()**| genera algunas métricas estadísticas descriptivas del dataframe, sólo para columnas numérics |
|**max()**| devuelve el valor máximo de cada columna numérica |
|**min()**| devuelve el valor mínimo de cada columna numérica |
|**std()**| devuelve la desviación estándar de cada columna numérica |
|**sample(n)**| devuelve un set aleatorio del dataframe |
|**dropna()**| elimina todos los elementos con valores nulos |

In [77]:
diccionario_gente = {
    
    'Nombre':['Tomás', 'Elena', 'Juana', 'Enrique'],
    'Edad':[28,34,29,42],
    'Ciudad':['Barcelona',"Tarragona",2,"Huesca"], 
    "Hermanos":[1,2,3,0]


}
diccionario_gente

{'Nombre': ['Tomás', 'Elena', 'Juana', 'Enrique'],
 'Edad': [28, 34, 29, 42],
 'Ciudad': ['Barcelona', 'Tarragona', 2, 'Huesca'],
 'Hermanos': [1, 2, 3, 0]}

Ejercicio: Genera un df del diccionario anterior y asígnale como indice de filas "Estudiante 1", "Estudiante 2", etc, y aplica cada uno de los métodos de la tabla anterior. Comentemos resultados.

In [78]:
filas = ['Estudiante1', 'Estudiante2', 'Estudiante3', 'Estudiante4']
df_2 = pd.DataFrame(data=diccionario_gente, index=filas)

In [79]:
df_2

              Nombre  Edad     Ciudad  Hermanos
Estudiante1    Tomás    28  Barcelona         1
Estudiante2    Elena    34  Tarragona         2
Estudiante3    Juana    29          2         3
Estudiante4  Enrique    42     Huesca         0

In [80]:
df_2.index = ['Nombre1', 'Nombre2', 'Nombre3', 'Nombre4']

In [81]:
df_2

          Nombre  Edad     Ciudad  Hermanos
Nombre1    Tomás    28  Barcelona         1
Nombre2    Elena    34  Tarragona         2
Nombre3    Juana    29          2         3
Nombre4  Enrique    42     Huesca         0

In [90]:
df_2.describe(include='all')

       Nombre       Edad     Ciudad  Hermanos
count       4   4.000000          4  4.000000
unique      4        NaN          4       NaN
top     Juana        NaN  Tarragona       NaN
freq        1        NaN          1       NaN
mean      NaN  33.250000        NaN  1.500000
std       NaN   6.396614        NaN  1.290994
min       NaN  28.000000        NaN  0.000000
25%       NaN  28.750000        NaN  0.750000
50%       NaN  31.500000        NaN  1.500000
75%       NaN  36.000000        NaN  2.250000
max       NaN  42.000000        NaN  3.000000

In [91]:
df_2.head(2)

        Nombre  Edad     Ciudad  Hermanos
Nombre1  Tomás    28  Barcelona         1
Nombre2  Elena    34  Tarragona         2

In [92]:
df_2.tail(2)

          Nombre  Edad  Ciudad  Hermanos
Nombre3    Juana    29       2         3
Nombre4  Enrique    42  Huesca         0

In [94]:
df_2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Nombre1 to Nombre4
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nombre    4 non-null      object
 1   Edad      4 non-null      int64
 2   Ciudad    4 non-null      object
 3   Hermanos  4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 160.0+ bytes

In [103]:
df_2.sample(frac=1, random_state=45, replace=True)

          Nombre  Edad     Ciudad  Hermanos
Nombre4  Enrique    42     Huesca         0
Nombre3    Juana    29          2         3
Nombre4  Enrique    42     Huesca         0
Nombre1    Tomás    28  Barcelona         1

In [104]:
df_2.dropna?

### Trasponer el DataFrame - .T

A veces puede resultarnos más manejable si trasponemos nuestro dataframe.

In [118]:
df_2

              Nombre  Edad     Ciudad  Hermanos
Estudiante1    Tomás    28  Barcelona         1
Estudiante2    Elena    34  Tarragona         2
Estudiante3    Juana    29     Lleida         3
Estudiante4  Enrique    42     Huesca         0

In [119]:
df_2.T

         Estudiante1 Estudiante2 Estudiante3 Estudiante4
Nombre         Tomás       Elena       Juana     Enrique
Edad              28          34          29          42
Ciudad     Barcelona   Tarragona      Lleida      Huesca
Hermanos           1           2           3           0

### Ordenar DataFrame - sort_index(), sort_values()

#### Ordenar por índices - df.sort_index()

In [105]:
dic_coches = {'Marca': ['Honda Civic','Toyota Corolla','Ford Focus','Audi A4'],
        'Precio': [22000,25000,27000,35000],
        'Año': [2015,2013,2018,2018]
        }
df = pd.DataFrame(dic_coches)
df

            Marca  Precio   Año
0     Honda Civic   22000  2015
1  Toyota Corolla   25000  2013
2      Ford Focus   27000  2018
3         Audi A4   35000  2018

##### Ordenar columnas - axis = 1

Ordenamos las columnas de izquierda a derecha según nombres de columnas en orden alfabético

In [106]:
df.sort_index(axis = 1)

    Año           Marca  Precio
0  2015     Honda Civic   22000
1  2013  Toyota Corolla   25000
2  2018      Ford Focus   27000
3  2018         Audi A4   35000

##### Ordenar filas - axis=0

In [107]:
df.sort_index(axis=0)

            Marca  Precio   Año
0     Honda Civic   22000  2015
1  Toyota Corolla   25000  2013
2      Ford Focus   27000  2018
3         Audi A4   35000  2018

In [108]:
df.sort_index(axis=0,ascending=False)

            Marca  Precio   Año
3         Audi A4   35000  2018
2      Ford Focus   27000  2018
1  Toyota Corolla   25000  2013
0     Honda Civic   22000  2015

#### Ordenar por valores

In [109]:
df

            Marca  Precio   Año
0     Honda Civic   22000  2015
1  Toyota Corolla   25000  2013
2      Ford Focus   27000  2018
3         Audi A4   35000  2018

In [110]:
df.sort_values(by=['Precio'])

            Marca  Precio   Año
0     Honda Civic   22000  2015
1  Toyota Corolla   25000  2013
2      Ford Focus   27000  2018
3         Audi A4   35000  2018

In [111]:
df.sort_values(by=['Año'], ascending = False)

            Marca  Precio   Año
2      Ford Focus   27000  2018
3         Audi A4   35000  2018
0     Honda Civic   22000  2015
1  Toyota Corolla   25000  2013

#### Ordenar por múltiples campos

In [112]:
df.sort_values(by=['Año','Precio'])

            Marca  Precio   Año
1  Toyota Corolla   25000  2013
0     Honda Civic   22000  2015
2      Ford Focus   27000  2018
3         Audi A4   35000  2018

Vemos que el Ford Focus aparece antes que  el Audi aun siendo del mismo año debido a que hemos ordenado también de menor a mayor precio

## Missing Data

Pandas utiliza mayoritariamente el valor *np.nan* para representar valores nulos.

Reindexar permite cambiar/añadir/borrar todo eje y puede generar nulos, como hemos visto.

### Borrar filas con missing data - .dropna( )

#### Borra toda fila o columna con al menos un NaN

In [113]:
df.dropna()

            Marca  Precio   Año
0     Honda Civic   22000  2015
1  Toyota Corolla   25000  2013
2      Ford Focus   27000  2018
3         Audi A4   35000  2018

#### Borra las columnas con al menos un Nan

In [114]:
df.dropna(axis='columns')

            Marca  Precio   Año
0     Honda Civic   22000  2015
1  Toyota Corolla   25000  2013
2      Ford Focus   27000  2018
3         Audi A4   35000  2018

#### Borra todas las filas con TODOS los elementos Nan

In [133]:
df.dropna?

In [120]:
df_n = pd.DataFrame(df, columns=['Marca', 'Precio', 'Año', 1, 2])
df_n

            Marca  Precio   Año   1   2
0     Honda Civic   22000  2015 NaN NaN
1  Toyota Corolla   25000  2013 NaN NaN
2      Ford Focus   27000  2018 NaN NaN
3         Audi A4   35000  2018 NaN NaN

In [121]:
df_n.dropna(how='all')

            Marca  Precio   Año   1   2
0     Honda Civic   22000  2015 NaN NaN
1  Toyota Corolla   25000  2013 NaN NaN
2      Ford Focus   27000  2018 NaN NaN
3         Audi A4   35000  2018 NaN NaN

In [134]:
df_n.dropna(how='all', axis=1)

            Marca  Precio   Año
0     Honda Civic   22000  2015
1  Toyota Corolla   25000  2013
2      Ford Focus   27000  2018
3         Audi A4   35000  2018

In [129]:
df_n.dropna(how='any')

Empty DataFrame
Columns: [Marca, Precio, Año, 1, 2]
Index: []

In [122]:
df_n.dropna()

Empty DataFrame
Columns: [Marca, Precio, Año, 1, 2]
Index: []

### Borra filas con cierto nº de NaN - .dropna( )

In [132]:
df_n.dropna(thresh=3) # borramos las filas con > 2 Nan

            Marca  Precio   Año   1   2
0     Honda Civic   22000  2015 NaN NaN
1  Toyota Corolla   25000  2013 NaN NaN
2      Ford Focus   27000  2018 NaN NaN
3         Audi A4   35000  2018 NaN NaN

### Rellena NaN valores - .fillna( )

In [135]:
df_n.fillna(value=5)

            Marca  Precio   Año    1    2
0     Honda Civic   22000  2015  5.0  5.0
1  Toyota Corolla   25000  2013  5.0  5.0
2      Ford Focus   27000  2018  5.0  5.0
3         Audi A4   35000  2018  5.0  5.0

In [136]:
df_n.fillna?

### Check dónde hay NaN - .isna( )

In [38]:
df.isna()

   Marca  Precio    Año
0  False   False  False
1  False   False  False
2  False   False  False
3  False   False  False

## Subset DataFrames

Mientras que las expresiones estándar de Python y NumPy para seleccionar columnas son fáciles e intuititvas, existen métodos especiales para realizar subsets de dataframes:

- .loc: selecciona una fila/columna mediante su nombre
- .iloc: selecciona una fila/columna mediante su índice
- .at: selecciona un único elemento mediante su nombre
- .iat: selecciona un único elemento mediante su índice

### Selección de Columnas

In [137]:
dic_coches = {'Marca': ['Honda','Toyota','Ford'],
        'Precio': [22000,25000,27000],
        'Año': [2015,2013,2018]
        }
df = pd.DataFrame(dic_coches)
df.index = ["Laura","Lorenzo","Arnau"]
df

          Marca  Precio   Año
Laura     Honda   22000  2015
Lorenzo  Toyota   25000  2013
Arnau      Ford   27000  2018

#### Mediante el nombre de la columna - [ ] como Series

Podemos seleccionar la columna deseada del dataframe mediante el nombre de la columna

In [130]:
df.columns

Index(['Marca', 'Precio', 'Año'], dtype='object')

In [138]:
mi_serie = df["Marca"]
mi_serie

Laura       Honda
Lorenzo    Toyota
Arnau        Ford
Name: Marca, dtype: object

El objeto resultante es una Serie

In [139]:
type(df['Marca'])

pandas.core.series.Series

#### Mediante el nombre de la columna - [ [ ] ] como df

Si quisiéramos extrar una columna como un DataFrame, lo haríamos mediante el doble claudátor

In [140]:
df[['Marca']]

          Marca
Laura     Honda
Lorenzo  Toyota
Arnau      Ford

In [141]:
type(df[['Marca']])

pandas.core.frame.DataFrame

#### Extraer múltiples columnas

Como un DataFrame es simplemente una lista de objetos, podemos extraer tantos como queramos mientras especifiquemos el nombre de las columnas

In [142]:
df[['Marca','Año']]

          Marca   Año
Laura     Honda  2015
Lorenzo  Toyota  2013
Arnau      Ford  2018

### Selección de Filas

Existen dos métodos para seleccionar filas de un DataFrame:
- **.loc()** - **loc**aliza por el nombre
- **.iloc()** - **loc**aliza por **í**ndice numérico

#### Selecciona por etiqueta - .loc( )

*df.loc()* nos permite acceder a un grupo de filas y columnas mediante la etiqueta/s

In [143]:
df

          Marca  Precio   Año
Laura     Honda   22000  2015
Lorenzo  Toyota   25000  2013
Arnau      Ford   27000  2018

In [144]:
df.loc["Laura"]

Marca     Honda
Precio    22000
Año        2015
Name: Laura, dtype: object

#### Selecciona por índice - .iloc()

In [145]:
df.iloc[0]

Marca     Honda
Precio    22000
Año        2015
Name: Laura, dtype: object

In [146]:
type(df.iloc[[0]])

pandas.core.frame.DataFrame

![title](https://www.w3resource.com/w3r_images/pandas-series-iloc-image-3.svg)

In [147]:
a = np.array([2,3,4,5])
matrix = [a, a*10, a*100]
df2 = pd.DataFrame(matrix, columns = ['p','q','r','s'])
df2

     p    q    r    s
0    2    3    4    5
1   20   30   40   50
2  200  300  400  500

In [148]:
df2.iloc[0]

p    2
q    3
r    4
s    5
Name: 0, dtype: int64

In [149]:
df2.loc[0]

p    2
q    3
r    4
s    5
Name: 0, dtype: int64

In [150]:
matrix = [(2,3,4,5), (20,30,40,50),(200,300,400,500)]
df = pd.DataFrame(matrix, columns = ['p','q','r','s'])
df

     p    q    r    s
0    2    3    4    5
1   20   30   40   50
2  200  300  400  500

In [217]:
matrix

[(2, 3, 4, 5), (20, 30, 40, 50), (200, 300, 400, 500)]

In [219]:
df = pd.DataFrame(data =matrix,columns=['p','q','r','s'] )
df

     p    q    r    s
0    2    3    4    5
1   20   30   40   50
2  200  300  400  500

![title](https://www.w3resource.com/w3r_images/pandas-series-iat-image-1.svg)

In [22]:
df2[:2]

    p   q   r   s
0   2   3   4   5
1  20  30  40  50

#### Mediante .loc() e .iloc() también podemos seleccionar columnas!

Recordemos que mediante slicing y el nombre de la columna podíamos obtener un subset del df con la columna deseada

In [137]:
df["Año"]

Laura      2015
Lorenzo    2013
Arnau      2018
Name: Año, dtype: int64

**Pero si hacemos uso del doble indexado también podemos usar .loc y .iloc para hacere subset de columnas**.

Para seleccionar la columna j tenemos que especificar que dada una columna queremos extraer todos sus elementos que se disponen en todas las filas del df.

Eso es, debemos especificar que queremos:
- dada la columna j
- todos los elementos de las filas

y según slicing de numpy arrays vimos que esto se escribe según: [ : , j ]

In [184]:
df.iloc[:, 2] #seleccionamos mediante el índice de tercera columna (índice 2), todas las filsa (:)

0   -1.107648
1    1.459905
2    0.029227
3   -1.942122
4    0.358801
5   -1.027046
6   -0.277405
7   -0.739683
8    1.232508
9   -0.484462
Name: 2, dtype: float64

In [139]:
df.loc[:, "Año"] #o lo que es lo mismo intercambiando el índice de posición de la columna deseada por su etiqueta con .loc

Laura      2015
Lorenzo    2013
Arnau      2018
Name: Año, dtype: int64

#### Seleccionar múltiples filas

In [198]:
dic_coches = {'Marca': ['Honda Civic','Toyota Corolla','Ford Focus','Audi A4', 'Seat Leon'],
        'Precio': [22000,25000,27000,35000,17000],
        'Año': [2015,2013,2018,2018,2017]
        }
df = pd.DataFrame(dic_coches)
df.index = ["Laura","Lorenzo","Arnau","Guillem","Guille"]
df

                  Marca  Precio   Año
Laura       Honda Civic   22000  2015
Lorenzo  Toyota Corolla   25000  2013
Arnau        Ford Focus   27000  2018
Guillem         Audi A4   35000  2018
Guille        Seat Leon   17000  2017

In [199]:
df.iloc[:2]  #obtenemos un df con hasta la fila 2

                  Marca  Precio   Año
Laura       Honda Civic   22000  2015
Lorenzo  Toyota Corolla   25000  2013

In [200]:
df.loc[["Laura","Lorenzo"]] #obtenemos un df que contiene las filas "Laura" y "Lorenzo"

                  Marca  Precio   Año
Laura       Honda Civic   22000  2015
Lorenzo  Toyota Corolla   25000  2013

### Selecciona un elemento - .at( ), .iat( )

#### Selecciona un elemento por etiqueta -.at ( )

df.at() nos permite seleccionar un único elemento del dataframe mediante su etiqueta

In [148]:
df

          Marca  Precio   Año
Laura     Honda   22000  2015
Lorenzo  Toyota   25000  2013
Arnau      Ford   27000  2018

In [357]:
df.at['Arnau','Año'] #el primer elemento es la etiqueta de la fila y el segundo la etiqueta de la columna

2018

#### Selecciona un elemento por índice - .iat( )

df.at() nos permite seleccionar un único elemento del dataframe mediante su índice

In [358]:
df

                  Marca  Precio   Año
Laura       Honda Civic   22000  2015
Lorenzo  Toyota Corolla   25000  2013
Arnau        Ford Focus   27000  2018
Guillem         Audi A4   35000  2018
Guille        Seat Leon   17000  2017

In [55]:
df.iat[2,2]

2018

![title](https://www.w3resource.com/w3r_images/pandas-series-iat-image-2.svg)

### Selección condicional de filas

Además de seleccionar según filas y columnas, puede que queramos hacer una selección condicional, es decir; obtener valores de un dataframe que cumplan una condición determinada

#### Filtrar por condiciones booleanas

##### EJEMPLO: Seleccionar los coches posteriores a 2016

In [155]:
coches_nuevos = (df['Año'] > 2016 )
coches_nuevos

Laura      False
Lorenzo    False
Arnau       True
Name: Año, dtype: bool

Esto nos devuelve qué filas cumplen la condición sobre la columna 'Año'.

##### EJEMPLO: Ahora queremos realizar el subset del dataframe

In [157]:
df[ df["Año"] > 2016]

      Marca  Precio   Año
Arnau  Ford   27000  2018

#### Filtrar por múltiples condiciones

Incluso podemos realizar subset de dataframes con **Múltiples condiciones**

##### EJEMPLO:  
Seleccionar los coches posteriores a 2016 y con menos de 20000€

In [57]:
df[  (df['Precio']<20000) & (df['Año']>2016)    ]

Empty DataFrame
Columns: [Marca, Precio, Año]
Index: []

**Importante!** Cuando filtramos por múltiples condiciones conviene poner cada condición dentro de un paréntesis!!!

#### Filtrar por contención - isin( )

Otro tipo de filtro sería la comprobación de si una fila contiene un elemento que nos interese. Tal comprobación la haremos mediante el método *isin( )*

##### EJEMPLO
Filtra los coches que son del año 2018

In [158]:
df.isin([2018])

         Marca  Precio    Año
Laura    False   False  False
Lorenzo  False   False  False
Arnau    False   False   True

In [159]:
df['Año'].isin([2018])

Laura      False
Lorenzo    False
Arnau       True
Name: Año, dtype: bool

In [161]:
df[df['Año'].isin([2018])]

      Marca  Precio   Año
Arnau  Ford   27000  2018

## Setting de un DataFrame

### Modificar un elemento

Modificar un elemento es tan sencillo como acceder a él y asignarle un nuevo valor!
Existen varios métodos para realizar tal tarea, los revisaremos a continuación.

#### Modificar un elemento según etiqueta - .at( )

In [162]:
df

          Marca  Precio   Año
Laura     Honda   22000  2015
Lorenzo  Toyota   25000  2013
Arnau      Ford   27000  2018

In [163]:
df.at['Laura', 'Año'] = 2016

In [164]:
df

          Marca  Precio   Año
Laura     Honda   22000  2016
Lorenzo  Toyota   25000  2013
Arnau      Ford   27000  2018

In [165]:
df.iat[0,2] = 2020
df

          Marca  Precio   Año
Laura     Honda   22000  2020
Lorenzo  Toyota   25000  2013
Arnau      Ford   27000  2018

#### Modificar un elemento según índice - .iat( )

In [369]:
df.iat[0,2] = 2017

In [370]:
df

                  Marca  Precio   Año
Laura       Honda Civic   22000  2017
Lorenzo  Toyota Corolla   25000  2013
Arnau        Ford Focus   27000  2018
Guillem         Audi A4   35000  2018
Guille        Seat Leon   17000  2017

### Añadir columnas

Añadir una columna a un df es tan sencillo como:
1. asignar un nuevo nombre al dataframe (eso genera una columna nueva vacía)
2. llenar la nueva columna con una lista o array, con mismas etiquetas que el df

##### EJEMPLO

In [166]:
df

          Marca  Precio   Año
Laura     Honda   22000  2020
Lorenzo  Toyota   25000  2013
Arnau      Ford   27000  2018

In [170]:
df['Kilometraje'] =  [1000,300000,20000]

In [171]:
df

          Marca  Precio   Año  Kilometraje
Laura     Honda   22000  2020         1000
Lorenzo  Toyota   25000  2013       300000
Arnau      Ford   27000  2018        20000

**Importante!!!** Si no llenáramos con tantos valores como filas tiene el dataframe, nos saltaría un error!

In [157]:
df['Pagado'] = ['Si','No','No']
df

     p    q    r    s Pagado
0    2    3    4    5     Si
1   20   30   40   50     No
2  200  300  400  500     No

### Drop columnas - .pop( )

Para eliminar columnas de un dataframe usaremos el método *.pop( )*, especificando el nombre de la columna a eliminar.

##### EJEMPLO

In [172]:
df

          Marca  Precio   Año  Kilometraje
Laura     Honda   22000  2020         1000
Lorenzo  Toyota   25000  2013       300000
Arnau      Ford   27000  2018        20000

In [173]:
df.pop('Kilometraje')
df

          Marca  Precio   Año
Laura     Honda   22000  2020
Lorenzo  Toyota   25000  2013
Arnau      Ford   27000  2018

### Eliminar filas - .drop( )

Para eliminar filas de un dataframe **usamos el índice** de los elementos que deseamos eliminar del Dataframe. Si el índice estuviera duplicado, se eliminarían múltiples filas.

In [175]:
df.drop("Laura")

          Marca  Precio   Año
Lorenzo  Toyota   25000  2013
Arnau      Ford   27000  2018

In [158]:
df.drop?

## Concatenar DataFrames -.append( ), -concat( )

### Introducción

Añadir una columna a un dataframe es una operación  vectorial, es decir; **elemento a elemento**

**Importante!** Recordar la propiedad de las Series en que no es necesaria congruencia de dimensiones entre dos DataFrames para operar entre ellos!

Si hubiera un mismatch de columnas o filas, el resultado de la operación **es la union de las dimensiones, llenando de nulos en aquellos ejes que uno de los dataframes no tuviera informado**

### Anexionar filas - .append( )

Para añadir filas a un dataframe ya existente usaremos el método .append(); que anexiona filas al final de un dataframe

In [159]:
d = {'columna 1' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'columna 2' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(d)
df

   columna 1  columna 2
a        1.0          1
b        2.0          2
c        3.0          3
d        NaN          4

#### Append elemento con columnas coincidentes

In [160]:
df.append(df)

   columna 1  columna 2
a        1.0          1
b        2.0          2
c        3.0          3
d        NaN          4
a        1.0          1
b        2.0          2
c        3.0          3
d        NaN          4

Si el elemento que anexamos tiene las mismas columnas que el dataframe destino, el método .append() añado los nuevos elementos al final

#### Append si no tenemos mismas columnas?

In [161]:
nueva_fila = [[1,2]]

In [162]:
nueva_fila

[[1, 2]]

In [163]:
f = pd.DataFrame(nueva_fila)
f

   0  1
0  1  2

In [164]:
df = df.append(f)

In [165]:
df

   columna 1  columna 2    0    1
a        1.0        1.0  NaN  NaN
b        2.0        2.0  NaN  NaN
c        3.0        3.0  NaN  NaN
d        NaN        4.0  NaN  NaN
0        NaN        NaN  1.0  2.0

In [166]:
df = df.append?

In [ ]:
df = df.append

Vemos que si las columnas del dataframe a anexar son distintas al dataframe destino, se crean nuevas columnas con y se añaden los elementos al final de tales columnas. Es decir, **el append con columnas diferentes aumenta la dimensionalidad del dataframe no sólo a lo largo de las filas sino que también de las columnas**

### Concantenar - .concat( )

Podemos usar la función *concat()* de Pandas para juntar filas o columnas de un DataFrame a otro.


**Importante!** Cuando concatenamos DataFrames hay que **especificar el eje**. 

- **axis=0**: indica a pandas de juntar el segundo dataframe **debajo** del primero. Pandas detecta si los dos dataframes tienen los mismos nombres de columnas y si es así, procederá a anexionar el segundo debajo el primero a modo de **nuevas filas** en las columnas del primer dataframe.

- **axis=1**: indica a pandas de concatenar el segundo dataframe **a la derecha** del primero, a modo de **nuevas columnas** para las filas originales del dataset.

##### EJEMPLO: Concatenar en axis=0

In [167]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  1.386845 -0.878776 -0.617221 -0.087457
1  0.333366 -0.228235 -1.126882 -0.025107
2 -0.120970 -0.120306 -0.417804  1.220607
3 -0.441339  0.393554 -0.199314 -1.682043
4 -2.194547 -1.494961  0.850160 -0.175762
5 -0.938153  0.657098 -0.349898 -0.989223
6  0.617936  0.651797 -1.691569  0.450782
7 -0.124744 -0.660927  0.847283 -0.263938
8  0.400589 -1.354543 -1.242614 -0.213369
9  1.375827  0.460495  0.661432 -0.915658

In [168]:
df.shape

(10, 4)

In [169]:
df2 = pd.DataFrame(np.random.randn(2, 2))
df2

          0         1
0  0.154078 -0.693673
1  0.193503 -0.066470

In [421]:
df2.shape

(2, 2)

In [170]:
horizontal_stack = pd.concat([df,df2],axis=0)
horizontal_stack

          0         1         2         3
0  1.386845 -0.878776 -0.617221 -0.087457
1  0.333366 -0.228235 -1.126882 -0.025107
2 -0.120970 -0.120306 -0.417804  1.220607
3 -0.441339  0.393554 -0.199314 -1.682043
4 -2.194547 -1.494961  0.850160 -0.175762
5 -0.938153  0.657098 -0.349898 -0.989223
6  0.617936  0.651797 -1.691569  0.450782
7 -0.124744 -0.660927  0.847283 -0.263938
8  0.400589 -1.354543 -1.242614 -0.213369
9  1.375827  0.460495  0.661432 -0.915658
0  0.154078 -0.693673       NaN       NaN
1  0.193503 -0.066470       NaN       NaN

In [420]:
horizontal_stack.shape

(12, 4)

##### EJEMPLO: Concatenar en axis=1

In [171]:
vertical_stack = pd.concat([df,df2],axis=1)
vertical_stack

          0         1         2         3         0         1
0  1.386845 -0.878776 -0.617221 -0.087457  0.154078 -0.693673
1  0.333366 -0.228235 -1.126882 -0.025107  0.193503 -0.066470
2 -0.120970 -0.120306 -0.417804  1.220607       NaN       NaN
3 -0.441339  0.393554 -0.199314 -1.682043       NaN       NaN
4 -2.194547 -1.494961  0.850160 -0.175762       NaN       NaN
5 -0.938153  0.657098 -0.349898 -0.989223       NaN       NaN
6  0.617936  0.651797 -1.691569  0.450782       NaN       NaN
7 -0.124744 -0.660927  0.847283 -0.263938       NaN       NaN
8  0.400589 -1.354543 -1.242614 -0.213369       NaN       NaN
9  1.375827  0.460495  0.661432 -0.915658       NaN       NaN

In [419]:
vertical_stack.shape

(10, 6)

In [172]:
pd.concat?

## Merge DataFrames- .merge( )

Como hemos visto, concatenar consta básicamente de juntar literalmente un dataframe a otro, en dirección vertical (añadiendo filas) o en dirección horizontal (añadiendo columnas).

Sin embargo, otra forma de combinar DataFrames con distinta información pero **usando las columnas de cada DataFrame que contienen valores comunes es el merge**. Lo definimos como **joining**. 

Las columnas que contiene valores comunes se llaman **join keys**.

**Realizar joins es especialmente útil para linkar tablas una de las cuales tiene información adicional (columnas adicionales) que complementa la tabla original**.

Este es el razonamiento usado en **SQL**.

El join se realiza mediante el comando *.merge( )*, que tiene los siguientes parámetros:

merge(df_1, df_2, on, how)

Dónde:
- df_1: es el dataframe a unir con
- df_2: el segundo dataframe
- on: indica el join key o columna común a partir de la cual se combinan df_1 y df_2
- how: es el tipo de join a realizar

En Pandas existen **4 tipos de joins**

![title](https://d2h0cx97tjks2p.cloudfront.net/blogs/wp-content/uploads/sites/2/2019/06/Pandas-Merge-and-Join-Functions-768x402.jpg)

##### Creamos dataframes para poder dar ejemplos

Creamos DataFrame **a**

In [173]:
compra_1={'elementos':[1,2,3,4,5],'categorias':['vegetal','vegetal','fruta','vegetal','fruta'],'nombres':['zanahoria','coliflor','manzana','patata','uvas']}
a = pd.DataFrame(compra_1, columns=['elementos','categorias','nombres'])
a

   elementos categorias    nombres
0          1    vegetal  zanahoria
1          2    vegetal   coliflor
2          3      fruta    manzana
3          4    vegetal     patata
4          5      fruta       uvas

Creamos DataFrame **b**

In [174]:
compra_2={'elementos':[4,5,6,7,8],'categorias':['vegetal','fruta','fruta','vegetal','fruta'],'nombres':['brócoli','mango','pera','guisantes','sandía']}
b = pd.DataFrame(compra_2, columns=['elementos','categorias','nombres'])
b

   elementos categorias    nombres
0          4    vegetal    brócoli
1          5      fruta      mango
2          6      fruta       pera
3          7    vegetal  guisantes
4          8      fruta     sandía

Creamos DataFrame **c**

In [175]:
compra_3={'elementos':[1,2,3,4,5,6,7,8,9,10],'precio':[12,23,98,15,88,24,67,58,26,96]}
c = pd.DataFrame(compra_3, columns=['elementos','precio'])
c

   elementos  precio
0          1      12
1          2      23
2          3      98
3          4      15
4          5      88
5          6      24
6          7      67
7          8      58
8          9      26
9         10      96

### Outer Join

Con un outer join de dos dataframes conseguimos en general un dataframe con todos los elementos de ambos dataframes.

Es decir, un outer join devuelve **todos los registros si hay un match en cualquiera de las tablas de la derecha o izquierda**

![title](https://d2h0cx97tjks2p.cloudfront.net/blogs/wp-content/uploads/sites/2/2019/06/Pandas-Outer-Join.jpg)

Es decir, para cada atributo de una columna, tenemos una versión x y una versión y provinientes de cada dataframe. 

- La versión x pertenence al primer dataframe y consiste de los miembros de su propio dataset además de los miembros comunes con el segundo dataset. Mientras que los no comunes se tratan como missing vales. 
- La versión y es lo mismo pero tomando como origen el segundo dataset.

**El outer join devuelve todos los registros que machean entre las dos tablas, aunque los otros registros machean o no**

##### EJEMPLO

In [438]:
a

   elementos categorias    nombres
0          1    vegetal  zanahoria
1          2    vegetal   coliflor
2          3      fruta    manzana
3          4    vegetal     patata
4          5      fruta       uvas

In [454]:
a.shape

(5, 3)

In [439]:
b

   elementos categorias    nombres
0          4    vegetal    brócoli
1          5      fruta      mango
2          6      fruta       pera
3          7    vegetal  guisantes
4          8      fruta     sandía

In [455]:
b.shape

(5, 3)

In [176]:
pd.merge?

In [437]:
outerjoin_ab = pd.merge(a,b,on="elementos",how='outer')
outerjoin_ab

   elementos categorias_x  nombres_x categorias_y  nombres_y
0          1      vegetal  zanahoria          NaN        NaN
1          2      vegetal   coliflor          NaN        NaN
2          3        fruta    manzana          NaN        NaN
3          4      vegetal     patata      vegetal    brócoli
4          5        fruta       uvas        fruta      mango
5          6          NaN        NaN        fruta       pera
6          7          NaN        NaN      vegetal  guisantes
7          8          NaN        NaN        fruta     sandía

In [456]:
outerjoin_ab.shape

(8, 5)

### Inner Join

En un inner join, sólo los valores comunes entre los dos dataframes se conservan.

Es decir, devuelve los **valores que machean en ambas tablas**

![title](https://d2h0cx97tjks2p.cloudfront.net/blogs/wp-content/uploads/sites/2/2019/06/pandas-Inner-join.jpg)

##### EJEMPLO:

In [450]:
a

   elementos categorias    nombres
0          1    vegetal  zanahoria
1          2    vegetal   coliflor
2          3      fruta    manzana
3          4    vegetal     patata
4          5      fruta       uvas

In [451]:
a.shape

(5, 3)

In [452]:
b

   elementos categorias    nombres
0          4    vegetal    brócoli
1          5      fruta      mango
2          6      fruta       pera
3          7    vegetal  guisantes
4          8      fruta     sandía

In [453]:
b.shape

(5, 3)

In [440]:
innerjoin_ab = pd.merge(a,b,on="elementos",how='inner')
innerjoin_ab

   elementos categorias_x nombres_x categorias_y nombres_y
0          4      vegetal    patata      vegetal   brócoli
1          5        fruta      uvas        fruta     mango

In [449]:
innerjoin_ab.shape

(2, 5)

### Right Join

Un **right join devuelve todos los registros de la tabla de la derecha** y los registros que machena de la tabla de la izquierda.

Es decir, la versión x de las columnas (del df de la izquierda) sólo mostraran los valores comunes y missing values, mientras que la versión y de las columnas mostrarán todos los valores, tanto los comunes como los únicos del segundo dataframe

![title](https://d2h0cx97tjks2p.cloudfront.net/blogs/wp-content/uploads/sites/2/2019/06/Pandas-right-join.jpg)

##### EJEMPLO

In [442]:
a

   elementos categorias    nombres
0          1    vegetal  zanahoria
1          2    vegetal   coliflor
2          3      fruta    manzana
3          4    vegetal     patata
4          5      fruta       uvas

In [448]:
a.shape

(5, 3)

In [443]:
b

   elementos categorias    nombres
0          4    vegetal    brócoli
1          5      fruta      mango
2          6      fruta       pera
3          7    vegetal  guisantes
4          8      fruta     sandía

In [447]:
b.shape

(5, 3)

In [441]:
rightjoin_ab = pd.merge(a,b,on="elementos",how='right')
rightjoin_ab

   elementos categorias_x nombres_x categorias_y  nombres_y
0          4      vegetal    patata      vegetal    brócoli
1          5        fruta      uvas        fruta      mango
2          6          NaN       NaN        fruta       pera
3          7          NaN       NaN      vegetal  guisantes
4          8          NaN       NaN        fruta     sandía

In [446]:
rightjoin_ab.shape

(5, 5)

### Left join

Un Left Join **devuelve todos los elementos de la tabla de la izquierda** y sólo los elementos de la tabla derecha que machean con la tabla de la izquierda.

Es decir, la versión x de las columnas (de la tabla de la izquierda) consiste en todos los elementos de la tabla de la izquierda, los que machean y los que no, mientras que la versión y de las columnas (de la tabla de la derecha) sólo los elementas que machean con la tabla de la izquierda

![title](https://d2h0cx97tjks2p.cloudfront.net/blogs/wp-content/uploads/sites/2/2019/06/Pandas-left-Join.jpg)

##### EJEMPLO

In [458]:
a

   elementos categorias    nombres
0          1    vegetal  zanahoria
1          2    vegetal   coliflor
2          3      fruta    manzana
3          4    vegetal     patata
4          5      fruta       uvas

In [459]:
b

   elementos categorias    nombres
0          4    vegetal    brócoli
1          5      fruta      mango
2          6      fruta       pera
3          7    vegetal  guisantes
4          8      fruta     sandía

In [457]:
leftjoin_ab = pd.merge(a,b,on="elementos",how='left')
leftjoin_ab

   elementos categorias_x  nombres_x categorias_y nombres_y
0          1      vegetal  zanahoria          NaN       NaN
1          2      vegetal   coliflor          NaN       NaN
2          3        fruta    manzana          NaN       NaN
3          4      vegetal     patata      vegetal   brócoli
4          5        fruta       uvas        fruta     mango

In [460]:
leftjoin_ab.shape

(5, 5)

## Join vía indices - .join( )

**join()** es básicamente un método similar al merge pero que utiliza los índices como *keys* del merge

Así, el método *df.join()* es un método conveniente para combinar columnas de dos DataFrames potencialmente indexados de forma distinta y convertirlos en un mismo DataFrame

##### EJEMPLO

In [177]:
A1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],'B': ['B0', 'B1', 'B2']},index=['K0', 'K1', 'K2'])

In [178]:
A1

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [179]:
A2 = pd.DataFrame({'C': ['C0', 'C1', 'C2'], 'D': ['D0', 'D1', 'D2']},index=['K0', 'K2', 'K3'])

In [182]:
A2

     C   D
K0  C0  D0
K2  C1  D1
K3  C2  D2

In [183]:
A3 = A1.join(A2)
A3

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [184]:
A1.join?

## Grouping

Con el **"group by"** se hace referencia al proceso de:
- separar o **splitting** del DataFrame en grupos según algun criterio
- aplicar o **apply**ing una función a cada grupo independientemente
- combinar o **combine**ining los resultados en una estructura de datos

El group by nos permite agrupar un dataframe a nivel de valores únicos, aplicando una función de sumarización a las columnas restantes entorno al valor de índice

In [190]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],'B': ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],'C': np.random.randn(8),'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one -0.428029 -1.438576
1  bar    one -0.831175  2.647136
2  foo    two  1.124319  0.847107
3  bar  three  1.253722 -1.020115
4  foo    two -1.107420  1.082960
5  bar    two -1.122494  0.625208
6  foo    one  1.203484 -1.876706
7  foo  three  1.514093 -1.605741

### Funciones de agregación sobre columnas numéricas

In [203]:
df.groupby?

In [192]:
#aplicar sum a C y count a D

In [193]:
df.groupby('A').sum()

            C         D
A
bar -0.699947  2.252229
foo  2.306447 -2.990956

In [194]:
df.groupby('B').mean()

              C         D
B
one   -0.018573 -0.222716
three  1.383907 -1.312928
two   -0.368532  0.851758

### Funciones de agrupación sobre numéricas y categóricas

In [195]:
df.groupby('B').max() #aplica a columnas numéricas y categóricas!b

         A         C         D
B
one    foo  1.203484  2.647136
three  foo  1.514093 -1.020115
two    foo  1.124319  1.082960

In [200]:
df.groupby('B').min() #aplica a columnas numéricas y categóricas!b

         A         C         D
B
one    bar -0.831175 -1.876706
three  bar  1.253722 -1.605741
two    bar -1.122494  0.625208

### Group by a varios niveles

In [202]:
df.groupby(['A','B']).min() #aplica a columnas numéricas y categóricas!b

                  C         D
A   B
bar one   -0.831175  2.647136
    three  1.253722 -1.020115
    two   -1.122494  0.625208
foo one   -0.428029 -1.876706
    three  1.514093 -1.605741
    two   -1.107420  0.847107

### Detalle de funciones de agregación o agrupación

|Función|Descripción|
|----|:------|
|mean()|Calcula la media del grupo|
|sum()|Calcula la suma del grupo de valores |
|size()|Calcula el tamaño del grupo|
|count()|Calcula el contador del grupo|
|std()|Calcula la desviación estandar del grupo|
|var()|Calcula la varianza del grupo|
|sem()|Calcula el error estandar del grupo|
|describe()|Genera estadística descriptiva|
|first()|Devuelve el primer elemento del grupo|
|last()|Devuelve el último elemento del grupo|
|nth()|Coge el *n*th elemento del grupo|
|min()|Calcula el valor mínimo del grupo|
|max()|Cacula el valor máximo del grupo|

### Aplicar múltiples funciones de golpe

In [490]:
df.groupby('A').agg([np.sum,np.mean,np.std])

            C                             D
          sum      mean       std       sum      mean       std
A
bar -2.145997 -0.715332  0.276260 -1.822869 -0.607623  1.276357
foo  1.004063  0.200813  0.763432 -3.826303 -0.765261  1.544253

# RESUMEN de métodos sobre DataFrames

## Métodos matemáticos

|Función|Description|
|:---|:---| 
|add()|Method is used to add series or list like objects with same length to the caller series|
|sub()|Method is used to subtract series or list like objects with same length from the caller series|
|mul()|Method is used to multiply series or list like objects with same length with the caller series|
|div()|Method is used to divide series or list like objects with same length by the caller series|
|sum()|Returns the sum of the values for the requested axis|
|prod()|Returns the product of the values for the requested axis|
|mean()|Returns the mean of the values for the requested axis|
|pow()|Method is used to put each element of passed series as exponential power of caller series and returned the results
|abs()|Method is used to get the absolute numeric value of each element in Series/DataFrame||
|cov()|Method is used to find covariance of two series|

## Métodos exploratorios

<style> table {display: block} </style>
|Función|Descripción|
|---|------|
|combine_first()|Method is used to combine two series into one|
|count()|Returns number of non-NA/null observations in the Series|
|size()|Returns the number of elements in the underlying data|
|name()|Method allows to give a name to a Series object, i.e. to the column|
|is_unique()|Method returns boolean if values in the object are unique|
|idxmax()|Method to extract the index positions of the highest values in a Series|
|idxmin()|Method to extract the index positions of the lowest values in a Series|
|sort_values()|Method is called on a Series to sort the values in ascending or descending order|
|sort_index()|Method is called on a pandas Series to sort it by the index instead of its values|
|head()|Method is used to return a specified number of rows from the beginning of a Series. The method returns a brand new Series|
|tail()|Method is used to return a specified number of rows from the end of a Series. The method returns a brand new Series|
|le()|Used to compare every element of Caller series with passed series.It returns True for every element which is Less than or Equal to the element in passed series|
|ne()|Used to compare every element of Caller series with passed series. It returns True for every element which is Not Equal to the element in passed series|
|ge()|Used to compare every element of Caller series with passed series. It returns True for every element which is Greater than or Equal to the element in passed series|
|eq()|Used to compare every element of Caller series with passed series. It returns True for every element which is Equal to the element in passed series|
|gt()|Used to compare two series and return Boolean value for every respective element|
|lt()|Used to compare two series and return Boolean value for every respective element|
|clip()|Used to clip value below and above to passed Least and Max value|
|clip_lower()|Used to clip values below a passed least value|
|clip_upper()|Used to clip values above a passed maximum value|
|astype()|Method is used to change data type of a series|
|tolist()|Method is used to convert a series to list|
|get()|Method is called on a Series to extract values from a Series. This is alternative syntax to the traditional bracket syntax|
|unique()|Pandas unique() is used to see the unique values in a particular column|
|nunique()|Pandas nunique() is used to get a count of unique values|
|value_counts()|Method to count the number of the times each unique value occurs in a Series|
|factorize()|Method helps to get the numeric representation of an array by identifying distinct values|
|map()|Method to tie together the values from one object to another|
|between()|Pandas between() method is used on series to check which values lie between first and second argument|
|apply()|Method is called and feeded a Python function as an argument to use the function on every Series value. This method is helpful for executing custom operations that are not included in pandas or numpy|

El fichero titanic.csv contiene información sobre los pasajeros del Titanic. Escribir un programa con los siguientes requisitos:

Generar un DataFrame con los datos del fichero. Para importar usaremos Pandas.
Mostrar por pantalla las dimensiones del DataFrame, el número de datos que contiene, los nombres de sus columnas y filas, los tipos de datos de las columnas, las 10 primeras filas y las 10 últimas filas
Mostrar por pantalla los datos del pasajero con identificador 148.
Mostrar por pantalla las filas pares del DataFrame.
Mostrar por pantalla los nombres de las personas que iban en primera clase ordenadas alfabéticamente.
Mostrar por pantalla el porcentaje de personas que sobrevivieron y murieron.
Mostrar por pantalla el porcentaje de personas que sobrevivieron en cada clase.
Eliminar del DataFrame los pasajeros con edad desconocida.
Mostrar por pantalla la edad media de las mujeres que viajaban en cada clase.
Añadir una nueva columna booleana para ver si el pasajero era menor de edad o no.
Mostrar por pantalla el porcentaje de menores y mayores de edad que sobrevivieron en cada clase.

In [204]:
df = pd.read_csv('titanic.csv')

In [205]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [207]:
df.set_index('PassengerId', inplace=True)

In [208]:
df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [209]:
df.shape

(891, 11)

In [210]:
df.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [211]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 123.5+ KB

In [213]:
df.loc[148]

Survived                                   0
Pclass                                     3
Name        Ford, Miss. Robina Maggie "Ruby"
Sex                                   female
Age                                        9
SibSp                                      2
Parch                                      2
Ticket                            W./C. 6608
Fare                                  34.375
Cabin                                    NaN
Embarked                                   S
Name: 148, dtype: object

In [215]:
df.iloc[df.index % 2 == 0]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...
882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [217]:
df[df['Pclass'] == 1].sort_values(by='Name')

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
731,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
298,0,1,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
499,0,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S
461,1,1,"Anderson, Mr. Harry",male,48.00,0,0,19952,26.5500,E12,S
...,...,...,...,...,...,...,...,...,...,...,...
156,0,1,"Williams, Mr. Charles Duane",male,51.00,0,1,PC 17597,61.3792,NaN,C
352,0,1,"Williams-Lambert, Mr. Fletcher Fellows",male,NaN,0,0,113510,35.0000,C128,S
56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S
556,0,1,"Wright, Mr. George",male,62.00,0,0,113807,26.5500,NaN,S
326,1,1,"Young, Miss. Marie Grice",female,36.00,0,0,PC 17760,135.6333,C32,C

In [221]:
df['Survived'].value_counts(normalize=True)

0    0.616162
1    0.383838
Name: Survived, dtype: float64

In [223]:
df.groupby(['Pclass']).mean()['Survived']

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [229]:
df.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age           0
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       529
Embarked      2
dtype: int64

In [228]:
df.dropna(subset=['Age'], inplace=True)

In [232]:
df[df['Sex'] == 'female'].groupby(by='Pclass').mean()['Survived']

Pclass
1    0.964706
2    0.918919
3    0.460784
Name: Survived, dtype: float64

In [237]:
df['es mayor de edad'] = (df['Age'] >= 18).astype(int)
df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,es mayor de edad
PassengerId,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1
...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q,1
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1

In [238]:
df['es mayor de edad'].value_counts(normalize=True)

1    0.841737
0    0.158263
Name: es mayor de edad, dtype: float64

In [240]:
df.groupby(['es mayor de edad']).mean()['Survived']

es mayor de edad
0    0.539823
1    0.381032
Name: Survived, dtype: float64

# Referencias

[Ref1](https://www.tutorialspoint.com/python_pandas/python_pandas_dataframe.htm)

[Ref2](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html)

[Ref3](https://www.learndatasci.com/tutorials/python-pandas-tutorial-complete-introduction-for-beginners/)

[Ref4](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)